ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
    GLOBAL_LOCK(irq);

    LPC24_UsbClient_Uninitialize(controller);

    State->Initialized = false;

    // for soft reboot allow the USB to be off for at least 100ms
    LPC24_Time_DelayNoInterrupt(nullptr, 100000); // 100ms

    return true;
}

bool UsbClient_Driver::OpenStream(int controller, int32_t& usbStream, TinyCLR_UsbClient_StreamMode mode) {
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || !State->Initialized)     // If no such controller exists (or it is not initialized)
        return false;

    int32_t writeEp = USB_NULL_ENDPOINT;
    int32_t readEp = USB_NULL_ENDPOINT;

    switch (mode) {
        case TinyCLR_UsbClient_StreamMode::In:
            // TODO
            return false;

        case TinyCLR_UsbClient_StreamMode::Out:
            // TODO
            return false;

        case TinyCLR_UsbClient_StreamMode::InOut:

            for (auto i = 0; i < SIZEOF_CONST_ARRAY(LPC24_UsbClient_EndpointMap); i++) {
                if ((LPC24_UsbClient_EndpointMap[i] & ENDPOINT_INUSED_MASK)) // in used
                    continue;

                if (writeEp == USB_NULL_ENDPOINT && ((LPC24_UsbClient_EndpointMap[i] & ENDPOINT_DIR_IN_MASK) == ENDPOINT_DIR_IN_MASK)) {
                    writeEp = i;
                    LPC24_UsbClient_EndpointMap[i] |= ENDPOINT_INUSED_MASK;

                    continue;
                }

                if (readEp == USB_NULL_ENDPOINT && ((LPC24_UsbClient_EndpointMap[i] & ENDPOINT_DIR_OUT_MASK) == ENDPOINT_DIR_OUT_MASK)) {
                    readEp = i;
                    LPC24_UsbClient_EndpointMap[i] |= ENDPOINT_INUSED_MASK;

                    continue;
                }

                if (writeEp != 0 && readEp != 0) {
                    break;
                }
            }
            // Check the usbStream and the two endpoint numbers for validity (both endpoints cannot be zero)
            if ((readEp == USB_NULL_ENDPOINT && writeEp == USB_NULL_ENDPOINT)
                || (readEp != USB_NULL_ENDPOINT && (readEp < 1 || readEp >= USB_MAX_QUEUES))
                || (writeEp != USB_NULL_ENDPOINT && (writeEp < 1 || writeEp >= USB_MAX_QUEUES)))
                return false;

            // The specified endpoints must not be in use by another stream
            for (int stream = 0; stream < USB_MAX_QUEUES; stream++) {
                if (readEp != USB_NULL_ENDPOINT && (State->streams[stream].RxEP == readEp || State->streams[stream].TxEP == readEp))
                    return false;
                if (writeEp != USB_NULL_ENDPOINT && (State->streams[stream].RxEP == writeEp || State->streams[stream].TxEP == writeEp))
                    return false;
            }

            for (usbStream = 0; usbStream < USB_MAX_QUEUES; usbStream++) {
                // The Stream must be currently closed
                if (State->streams[usbStream].RxEP == USB_NULL_ENDPOINT && State->streams[usbStream].TxEP == USB_NULL_ENDPOINT)
                    break;
            }

            if (usbStream == USB_MAX_QUEUES)
                return false; // full endpoint

            // All tests pass, assign the endpoints to the stream
            State->streams[usbStream].RxEP = readEp;
            State->streams[usbStream].TxEP = writeEp;

            TinyCLR_UsbClient_ConfigurationDescriptor *config = (TinyCLR_UsbClient_ConfigurationDescriptor *)UsbDefaultConfiguration.config;
            TinyCLR_UsbClient_EndpointDescriptor  *ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)config) + USB_CONFIGURATION_DESCRIPTOR_LENGTH + sizeof(TinyCLR_UsbClient_DescriptorHeader) + sizeof(TinyCLR_UsbClient_InterfaceDescriptor));

            uint8_t * end = ((uint8_t *)config) + config->header.size;

            while (((uint8_t *)ep) != nullptr && ((uint8_t *)ep) < end) {
                if (USB_ENDPOINT_DESCRIPTOR_TYPE != ep->bDescriptorType || sizeof(TinyCLR_UsbClient_EndpointDescriptor) != ep->bLength)
                    break;

                auto idx = 0;

                if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_IN) {
                    ep->bEndpointAddress |= writeEp;
                    idx = writeEp;
                    State->IsTxQueue[idx] = true;
                }

                else if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_OUT) {
                    ep->bEndpointAddress |= readEp;
                    idx = readEp;
                    State->IsTxQueue[idx] = false;
                }

                if (idx > 0) {
                    QueueBuffers[idx - 1] = std::vector< USB_PACKET64>();
                    State->Queues[idx] = &QueueBuffers[idx - 1];


                    State->MaxPacketSize[idx] = ep->wMaxPacketSize;
                }

                ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)ep) + ep->bLength);
            }


            break;
    }

    if (State->CurrentState == USB_DEVICE_STATE_UNINITIALIZED) {
        LPC24_UsbClient_Initialize(controller);
    }
    else if (State->Configured) {
        LPC24_UsbClient_SoftReset(controller);
    }

    State->Configured = true;

    return true;
}

bool UsbClient_Driver::CloseStream(int controller, int usbStream) {
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || !State->Initialized || usbStream >= USB_MAX_QUEUES)
        return false;

    int endpoint;
    GLOBAL_LOCK(irq);

    // Close the Rx stream
    endpoint = State->streams[usbStream].RxEP;
    if (endpoint != USB_NULL_ENDPOINT && State->Queues[endpoint]) {
        State->Queues[endpoint]->clear(); // Clear the queue
        QueueBuffers[endpoint - 1] = std::vector< USB_PACKET64>();
    }

    State->streams[usbStream].RxEP = USB_NULL_ENDPOINT;
    //Free endpoint
    LPC24_UsbClient_EndpointMap[endpoint] &= ~ENDPOINT_INUSED_MASK;

    // Close the TX stream
    endpoint = State->streams[usbStream].TxEP;
    if (endpoint != USB_NULL_ENDPOINT && State->Queues[endpoint]) {
        State->Queues[endpoint]->clear(); // Clear the queue
        QueueBuffers[endpoint - 1] = std::vector< USB_PACKET64>();
    }

    State->streams[usbStream].TxEP = USB_NULL_ENDPOINT;

