ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
            if (Setup->wIndex >= State->EndpointCount) {
                return USB_STATE_STALL;
            }

            status = &State->EndpointStatus[Setup->wIndex];
            break;

        default:
            return USB_STATE_STALL;
    }

    /* send requested status to host */
    State->ResidualData = (uint8_t*)status;
    State->ResidualCount = 2;
    State->DataCallback = USB_DataCallback;

    return USB_STATE_DATA;
}

uint8_t USB_HandleClearFeature(USB_CONTROLLER_STATE* State, USB_SETUP_PACKET* Setup) {
    TinyCLR_UsbClient_ConfigurationDescriptor * Config;
    uint8_t       retState;

    /* validate setup packet */
    if (Setup->wLength != 0) {
        return USB_STATE_STALL;
    }

    /* validate based on device state */
    if (State->DeviceState != USB_DEVICE_STATE_CONFIGURED) {
        return USB_STATE_STALL;
    }

    switch (USB_SETUP_RECIPIENT(Setup->bmRequestType)) {
        case USB_SETUP_RECIPIENT_DEVICE:
            // only support Remote wakeup
            if (Setup->wValue != USB_FEATURE_DEVICE_REMOTE_WAKEUP)
                return USB_STATE_STALL;

            // Locate the configuration descriptor
            Config = (TinyCLR_UsbClient_ConfigurationDescriptor *)USB_FindRecord(State, USB_CONFIGURATION_DESCRIPTOR_MARKER, Setup);

            if (Config && (Config->bmAttributes & USB_ATTRIBUTE_REMOTE_WAKEUP)) {
                State->DeviceStatus &= ~USB_STATUS_DEVICE_REMOTE_WAKEUP;
                retState = USB_STATE_REMOTE_WAKEUP;
            }
            else {
                return USB_STATE_STALL;
            }
            break;

        case USB_SETUP_RECIPIENT_INTERFACE:
            /* there are no interface features to clear */
            return USB_STATE_STALL;

        case USB_SETUP_RECIPIENT_ENDPOINT:
            if (State->DeviceState == USB_DEVICE_STATE_ADDRESS && Setup->wIndex != 0)
                return USB_STATE_STALL;

            /* bit 0x80 designates direction, which we dont utilize in this calculation */
            Setup->wIndex &= 0x7F;

            if (Setup->wIndex == 0 || Setup->wIndex >= State->EndpointCount)
                return USB_STATE_STALL;

            if (Setup->wValue != USB_FEATURE_ENDPOINT_HALT)
                return USB_STATE_STALL;

            /* clear the halt feature */
            State->EndpointStatus[Setup->wIndex] &= ~USB_STATUS_ENDPOINT_HALT;
            State->EndpointStatusChange = Setup->wIndex;
            retState = USB_STATE_STATUS;
            break;

        default:
            return USB_STATE_STALL;
    }

    /* send zero-length packet to tell host we're done */
    State->ResidualCount = 0;
    State->DataCallback = USB_DataCallback;

    /* notify lower layer of status change */
    return retState;
}

uint8_t USB_HandleSetFeature(USB_CONTROLLER_STATE* State, USB_SETUP_PACKET* Setup) {
    TinyCLR_UsbClient_ConfigurationDescriptor * Config;
    uint8_t       retState;

    /* validate setup packet */
    if (Setup->wLength != 0) {
        return USB_STATE_STALL;
    }

    /* validate based on device state */
    if (State->DeviceState == USB_DEVICE_STATE_DEFAULT) {
        return USB_STATE_STALL;
    }

    switch (USB_SETUP_RECIPIENT(Setup->bmRequestType)) {
        case USB_SETUP_RECIPIENT_DEVICE:
            // only support Remote wakeup
            if (Setup->wValue != USB_FEATURE_DEVICE_REMOTE_WAKEUP) {
                return USB_STATE_STALL;
            }

            Config = (TinyCLR_UsbClient_ConfigurationDescriptor *)USB_FindRecord(State, USB_CONFIGURATION_DESCRIPTOR_MARKER, Setup);
            if (Config == nullptr)        // If the configuration record could not be found
                return USB_STATE_STALL; // Something pretty serious is wrong

            if (Config->bmAttributes & USB_ATTRIBUTE_REMOTE_WAKEUP) {
                State->DeviceStatus |= USB_STATUS_DEVICE_REMOTE_WAKEUP;
            }

            retState = USB_STATE_REMOTE_WAKEUP;
            break;

        case USB_SETUP_RECIPIENT_INTERFACE:
            /* there are no interface features to set */
            return USB_STATE_STALL;

        case USB_SETUP_RECIPIENT_ENDPOINT:
            if (State->DeviceState == USB_DEVICE_STATE_ADDRESS && Setup->wIndex != 0) {
                return USB_STATE_STALL;
            }

            /* bit 0x80 designates direction, which we don't utilize in this calculation */
            Setup->wIndex &= 0x7F;

            if (Setup->wIndex == 0 || Setup->wIndex >= State->EndpointCount) {
                return USB_STATE_STALL;
            }

            if (Setup->wValue != USB_FEATURE_ENDPOINT_HALT) {
                return USB_STATE_STALL;
            }

            /* set the halt feature */
            State->EndpointStatus[Setup->wIndex] |= USB_STATUS_ENDPOINT_HALT;
            State->EndpointStatusChange = Setup->wIndex;
            retState = USB_STATE_STATUS;
            break;

        default:
            return USB_STATE_STALL;
    }

    /* send zero-length packet to tell host we're done */
    State->ResidualCount = 0;
    State->DataCallback = USB_DataCallback;

    /* notify lower layer of status change */
    return retState;
}

uint8_t USB_HandleSetAddress(USB_CONTROLLER_STATE* State, USB_SETUP_PACKET* Setup) {
    /* validate setup packet */
    if (Setup->wValue > 127 || Setup->wIndex != 0 || Setup->wLength != 0) {
        return USB_STATE_STALL;
    }

    /* validate based on device state */
    if (State->DeviceState >= USB_DEVICE_STATE_CONFIGURED) {
        return USB_STATE_STALL;
    }

    /* set address */
    State->Address = Setup->wValue;

    /* catch state changes */
    if (State->Address == 0) {
        State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    }
    else {
        State->DeviceState = USB_DEVICE_STATE_ADDRESS;
    }

    LPC24_UsbClient_StateCallback(State);

    /* send zero-length packet to tell host we're done */
    State->ResidualCount = 0;
    State->DataCallback = USB_DataCallback;

    /* notify hardware of address change */
    return USB_STATE_ADDRESS;
}

uint8_t USB_HandleConfigurationRequests(USB_CONTROLLER_STATE* State, USB_SETUP_PACKET* Setup) {
    const TinyCLR_UsbClient_DescriptorHeader * header;
    uint8_t       type;
    uint8_t       DescriptorIndex;

    /* this request is valid regardless of device state */
    type = ((Setup->wValue & 0xFF00) >> 8);
    DescriptorIndex = (Setup->wValue & 0x00FF);
    State->Expected = Setup->wLength;

    if (State->Expected == 0) {
        // just return an empty Status packet
        State->ResidualCount = 0;
        State->DataCallback = USB_DataCallback;
        return USB_STATE_DATA;
    }

    //
    // The very first GET_DESCRIPTOR command out of reset should always return at most PacketSize bytes.
    // After that, you can return as many as the host has asked.
    //
    if (State->DeviceState <= USB_DEVICE_STATE_DEFAULT) {
        if (State->FirstGetDescriptor) {
            State->FirstGetDescriptor = false;

            State->Expected = __min(State->Expected, State->PacketSize);
        }
    }

    State->ResidualData = nullptr;
    State->ResidualCount = 0;

