ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
#if defined(USB_METRIC_COUNTING)
    USB_PERFORMANCE_METRICS PerfMetrics;
#endif

    //--//

    static USB_CONTROLLER_STATE * GetState(int Controller);

    static bool Initialize(int Controller);

    static bool Uninitialize(int Controller);

    static bool StartOutput(USB_CONTROLLER_STATE* State, int endpoint);

    static bool RxEnable(USB_CONTROLLER_STATE* State, int endpoint);

    static bool GetInterruptState();

    static bool ProtectPins(int Controller, bool On);

    //private:

    static void ProcessEP0(int in, int setup);
    static void ProcessEndPoint(int ep, int in);

    static void ClearTxQueue(USB_CONTROLLER_STATE* State, int endpoint);

    static void StartHardware();

    static void StopHardware();

    static void TxPacket(USB_CONTROLLER_STATE* State, int endpoint);

    static void ControlNext();

    static void SuspendEvent();
    static void ResumeEvent();
    static void ResetEvent();

    static void Global_ISR(void*  Param);
    static void EP0_ISR(uint32_t Param);
    static void EP_TxISR(uint32_t Param);
    static void EP_RxISR(uint32_t Param);


#if defined(USB_REMOTE_WAKEUP)
    static void RemoteWkUp_ISR(void* Param);
    static void RemoteWkUp_Process(void* Param);
#endif
};

extern LPC24_USB_Driver g_LPC24_USB_Driver;

union EndpointConfiguration {
    struct {
        unsigned EE : 1;      // Endpoint enable (1 = enable)
        unsigned DE : 1;      // Double buffer enable (1 = double buffered)
        unsigned MPS : 10;      // Maximum packet size (iso=1-1023, blk=8,16,32,64, int=1-64
        unsigned ED : 1;      // Endpoint direction (1 = IN)
        unsigned ET : 2;      // Endpoint type (1=iso, 2=blk, 3=int)
        unsigned EN : 4;      // Endpoint number (1-15)
        unsigned AISN : 3;      // Alternate Interface number
        unsigned IN : 3;      // Interface number
        unsigned CN : 2;      // Configuration number
    } bits;
    uint32_t word;
};

LPC24_USB_Driver g_LPC24_USB_Driver;


bool LPC24_UsbClient_Initialize(int controller) {
    if ((uint32_t)controller >= TOTAL_USB_CONTROLLER)
        return false;

    return LPC24_USB_Driver::Initialize(controller);
}

bool LPC24_UsbClient_Uninitialize(int controller) {
    return LPC24_USB_Driver::Uninitialize(controller);
}

bool LPC24_UsbClient_StartOutput(USB_CONTROLLER_STATE* State, int ep) {

    return LPC24_USB_Driver::StartOutput(State, ep);
}

bool LPC24_UsbClient_RxEnable(USB_CONTROLLER_STATE* State, int ep) {

    return LPC24_USB_Driver::RxEnable(State, ep);
}

// Specific driver

//EP Types:
#define GHI_EP_TYPE_CONTROL 0
#define GHI_EP_TYPE_ISO     1
#define GHI_EP_TYPE_BULK    2
#define GHI_EP_TYPE_INT     3

// LPC datasheet
const char EP_Type_Table[16] =
{
GHI_EP_TYPE_CONTROL,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_ISO,
GHI_EP_TYPE_INT,
GHI_EP_TYPE_BULK,
GHI_EP_TYPE_BULK,
};

bool _appendZP = true;

USB_CONTROLLER_STATE UsbControllerState[1];     // Only 1 USB Controller for this device

//Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[LPC24_USB_Driver::c_Used_Endpoints-1];

static EndpointConfiguration EndpointInit[LPC24_USB_Driver::c_Used_Endpoints];     // Corresponds to endpoint configuration RAM at LPC24_USB::UDCCRx

///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////Gus added USB functions////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
static uint8_t  USB_DeviceAddress = 0;
static int nacking_rx_OUT_data[LPC24_USB_Driver::c_Used_Endpoints];
#define CONTORL_EP_ADDR	0x80

#define USB_POWER           0
//#define USB_IF_NUM          4
#define USB_EP_NUM          32
#define USB_MAX_PACKET0     64
#define USB_DMA             0
#define USB_DMA_EP          0x00000000

#define USB_POWER_EVENT     0
#define USB_RESET_EVENT     1
#define USB_WAKEUP_EVENT    0
#define USB_SOF_EVENT       0
#define USB_ERROR_EVENT     0
#define USB_EP_EVENT        0x0003
#define USB_CONFIGURE_EVENT 1
#define USB_INTERFACE_EVENT 0
#define USB_FEATURE_EVENT   0

#define EP_MSK_CTRL 0x0001      /* Control Endpoint Logical Address Mask */
#define EP_MSK_BULK 0xC924      /* Bulk Endpoint Logical Address Mask */
#define EP_MSK_INT  0x4492      /* Interrupt Endpoint Logical Address Mask */
#define EP_MSK_ISO  0x1248      /* Isochronous Endpoint Logical Address Mask */



void GHAL_USBC_AppendZeroPacketToWrite(bool appendZP) {
    _appendZP = appendZP;
}
static void WrCmd(uint32_t cmd) {
    USBDevIntClr = CCEMTY_INT | CDFULL_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
}
static void WrCmdDat(uint32_t cmd, uint32_t val) {
    USBDevIntClr = CCEMTY_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
    USBDevIntClr = CCEMTY_INT;
    USBCmdCode = val;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
}
static uint32_t RdCmdDat(uint32_t cmd) {
    USBDevIntClr = CCEMTY_INT | CDFULL_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CDFULL_INT) == 0);
    return (USBCmdData);
}

static void USB_SetAddress(uint32_t adr) {
    WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /* Don't wait for next */
    WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /*  Setup Status Phase */
}

static void USB_Reset(void) {

    USBEpInd = 0;
    USBEpMaxPSize = USB_MAX_PACKET0;
    USBEpInd = 1;
    USBEpMaxPSize = USB_MAX_PACKET0;
    while ((USBDevIntSt & EP_RLZED_INT) == 0);

    USBEpIntClr = 0xFFFFFFFF;
    USBEpIntEn = 0xFFFFFFFF ^ USB_DMA_EP;
    USBDevIntClr = 0xFFFFFFFF;
    USBDevIntEn = DEV_STAT_INT | EP_SLOW_INT |
        (USB_SOF_EVENT ? FRAME_INT : 0) |
        (USB_ERROR_EVENT ? ERR_INT : 0);

