ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
}

void USB_Connect(bool con) {
    WrCmdDat(CMD_SET_DEV_STAT, DAT_WR_BYTE(con ? DEV_CON : 0));
}
uint32_t EPAdr(uint32_t EPNum, int8_t in) {
    uint32_t val;

    val = (EPNum & 0x0F) << 1;
    if (in) {
        val += 1;
    }
    return (val);
}

static uint32_t USB_WriteEP(uint32_t EPNum, uint8_t *pData, uint32_t cnt) {
    uint32_t n, g;
    USBCtrl = ((EPNum & 0x0F) << 2) | CTRL_WR_EN;

    USBTxPLen = cnt;

    for (n = 0; n < (cnt + 3) / 4; n++) {
        g = *(pData + 3);
        g <<= 8;
        g |= *(pData + 2);
        g <<= 8;
        g |= *(pData + 1);
        g <<= 8;
        g |= *pData;
        USBTxData = g;
        pData += 4;
    }

    USBCtrl = 0;

    WrCmd(CMD_SEL_EP(EPAdr(EPNum, 1)));
    WrCmd(CMD_VALID_BUF);

    return (cnt);
}

static uint32_t USB_ReadEP(uint32_t EPNum, uint8_t *pData) {
    uint32_t cnt, n, d;

    USBCtrl = ((EPNum & 0x0F) << 2) | CTRL_RD_EN;

    do {
        cnt = USBRxPLen;
    } while ((cnt & PKT_RDY) == 0);

    cnt &= PKT_LNGTH_MASK;

    for (n = 0; n < (cnt + 3) / 4; n++) {
        d = USBRxData;
        *pData++ = d;
        *pData++ = d >> 8;
        *pData++ = d >> 16;
        *pData++ = d >> 24;
    }

    USBCtrl = 0;

    if (((EP_MSK_ISO >> EPNum) & 1) == 0)    /* Non-Isochronous Endpoint */
    {
        WrCmd(CMD_SEL_EP(EPAdr(EPNum, 0)));
        WrCmd(CMD_CLR_BUF);
    }

    return (cnt);
}

static void USB_SetStallEP(uint32_t EPNum, int8_t in) {
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum, in)), DAT_WR_BYTE(EP_STAT_ST));
}

void LPC24_USB_Driver::ProcessEndPoint(int ep, int in) {
    int val;
    //interrupt flags are not cleared yet
    if (in) {
        EP_TxISR(ep);
    }
    else {
        USBEpIntClr = 1 << EPAdr(ep, in);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;
        EP_RxISR(ep);
    }

}

void USB_ConfigEP(uint8_t ep_addr, int8_t in, uint8_t size) {
    uint32_t num;

    num = EPAdr(ep_addr, in);
    USBReEp |= (1 << num);
    USBEpInd = num;
    USBEpMaxPSize = size;
    while ((USBDevIntSt & EP_RLZED_INT) == 0);
    USBDevIntClr = EP_RLZED_INT;
}
void USB_EnableEP(uint32_t EPNum, int8_t in) {
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum, in)), DAT_WR_BYTE(0));
}
void USB_DisableEP(int32_t EPNum, int8_t in) {
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum, in)), DAT_WR_BYTE(EP_STAT_DA));
}
void USB_ResetEP(uint32_t EPNum, int8_t in) {
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum, in)), DAT_WR_BYTE(0));
}

void USB_HW_Configure(bool cfg) {
    WrCmdDat(CMD_CFG_DEV, DAT_WR_BYTE(cfg ? CONF_DVICE : 0));

    USBReEp = 0x00000003;
    while ((USBDevIntSt & EP_RLZED_INT) == 0);
    USBDevIntClr = EP_RLZED_INT;
}

///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
USB_CONTROLLER_STATE * LPC24_USB_Driver::GetState(int Controller) {
    if (Controller != 0)       // There is only one controller for this device
        return nullptr;
    return &UsbControllerState[0];
}

bool LPC24_USB_Driver::Initialize(int Controller) {
    int endpointsUsed = 0;

    USB_CONTROLLER_STATE &State = UsbControllerState[0];

    GLOBAL_LOCK(irq);

    LPC24_Interrupt_Activate(USB_IRQn, (uint32_t*)&Global_ISR, 0);

    for (int i = 0; i < c_Used_Endpoints; i++)
        EndpointInit[i].word = 0;       // All useable endpoints initialize to unused

    for (auto stream = 0; stream < c_Used_Endpoints; stream++) {
        auto idx = 0;
        if (State.streams[stream].RxEP != USB_NULL_ENDPOINT) {
            idx = State.streams[stream].RxEP;
            EndpointInit[idx].bits.ED = 0;
            EndpointInit[idx].bits.DE = 0;
        }

        if (State.streams[stream].TxEP != USB_NULL_ENDPOINT) {
            idx = State.streams[stream].TxEP;
            EndpointInit[idx].bits.ED = 1;
            EndpointInit[idx].bits.DE = 1;
        }

        if (idx != 0) {
            EndpointInit[idx].bits.EN = idx;
            EndpointInit[idx].bits.IN = 0;//itfc->bInterfaceNumber;
            EndpointInit[idx].bits.ET = USB_ENDPOINT_ATTRIBUTE_BULK & 0x03; //ep->bmAttributes & 0x03;
            EndpointInit[idx].bits.CN = 1;        // Always only 1 configuration = 1
            EndpointInit[idx].bits.AISN = 0;        // No alternate interfaces
            EndpointInit[idx].bits.EE = 1;        // Enable this endpoint
            EndpointInit[idx].bits.MPS = State.MaxPacketSize[idx];
        }
    }

    g_LPC24_USB_Driver.pUsbControllerState = &State;
    g_LPC24_USB_Driver.PinsProtected = true;

    State.EndpointStatus = &g_LPC24_USB_Driver.EndpointStatus[0];
    State.EndpointCount = c_Used_Endpoints;
    State.PacketSize = c_default_ctrl_packet_size;

    State.FirstGetDescriptor = true;

    ProtectPins(Controller, false);

    return true;
}

bool LPC24_USB_Driver::Uninitialize(int Controller) {
    GLOBAL_LOCK(irq);

    ProtectPins(Controller, true);

    g_LPC24_USB_Driver.pUsbControllerState = nullptr;

    //LPC24_Interrupt_Deactivate( LPC24_AITC::c_IRQ_INDEX_USB_CLIENT );
    LPC24_Interrupt_Deactivate(USB_IRQn);

    memset(UsbControllerState, 0, sizeof(USB_CONTROLLER_STATE));

    return true;
}
//volatile int test_flag = 1;
bool LPC24_USB_Driver::StartOutput(USB_CONTROLLER_STATE* State, int endpoint) {
    int32_t m, n, val;


    GLOBAL_LOCK(irq);

    /* if the halt feature for this endpoint is set, then just
       clear all the characters */
    if (State->EndpointStatus[endpoint] & USB_STATUS_ENDPOINT_HALT) {
        ClearTxQueue(State, endpoint);
        return true;
    }

    //If TxRunning, interrupts will drain the queue
    if (!g_LPC24_USB_Driver.TxRunning[endpoint]) {
        g_LPC24_USB_Driver.TxRunning[endpoint] = true;

        // Calling both TxPacket & EP_TxISR in this routine could cause a TX FIFO overflow
        TxPacket(State, endpoint);
    }
    else if (irq.WasDisabled()) {

        n = EPAdr(endpoint, 1); // It is an output endpoint for sure
        if ((USBEpIntSt & (1 << n)))//&& (USBEpIntEn & (1 << n)) )//only if enabled
        {
            m = n >> 1;


            if (m == 0)//EP0
            {
                USBEpIntClr = 1 << n;
                while ((USBDevIntSt & CDFULL_INT) == 0);
                val = USBCmdData;

                if (val & EP_SEL_STP)        /* Setup Packet */
                {
                    ProcessEP0(0, 1);// out setup
                }
                else {
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        ProcessEP0(0, 0);// out not setup
                    }
                    else {
                        ProcessEP0(1, 0);// in not setup
                    }
                }


