ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
            }
            else {
                if (State->Queues[m] && State->IsTxQueue[endpoint])
                    ProcessEndPoint(m, 1);//out
                else
                    ProcessEndPoint(m, 0);//in
            }

        }



    }

    return true;
}

bool LPC24_USB_Driver::GetInterruptState() {
    return true;/////////////////////////////////////////////////
}

//--//

void LPC24_USB_Driver::ClearTxQueue(USB_CONTROLLER_STATE* State, int endpoint) {

    while (nullptr != LPC24_UsbClient_TxDequeue(State, endpoint, true)) {
        State->Queues[endpoint]->erase(State->Queues[endpoint]->begin());
    }
}


bool LPC24_UsbClient_SoftReset(int controller) {
    LPC24_Interrupt_Activate(USB_IRQn, (uint32_t*)&LPC24_USB_Driver::Global_ISR, 0);

    return true;
}
//--//

void LPC24_USB_Driver::StartHardware() {
    *(uint32_t*)0xE01FC0C4 |= 0x80000000;
    USBClkCtrl = (1 << 1) | (1 << 3) | (1 << 4);

    LPC24_UsbClient_PinConfiguration();

    USB_Reset();
    USB_SetAddress(0);

    USBDevIntEn = DEV_STAT_INT;	/* Enable Device Status Interrupt */

    USB_Connect(false);
    // delay if removed and then connected...
    LPC24_Time_Delay(nullptr, 120 * 1000);

    USB_Connect(true);

}

void LPC24_USB_Driver::StopHardware() {
    USB_Connect(false);
}

void LPC24_USB_Driver::TxPacket(USB_CONTROLLER_STATE* State, int endpoint) {

    GLOBAL_LOCK(irq);

    // transmit a packet on UsbPortNum, if there are no more packets to transmit, then die
    USB_PACKET64* Packet64;
    bool done = false;

    for (;;) {
        done = true;
        Packet64 = LPC24_UsbClient_TxDequeue(State, endpoint, true);

        if (Packet64 == nullptr || Packet64->Size > 0) {
            break;
        }
        else if (Packet64->Size == 0) {
            if (done) {
                State->Queues[endpoint]->erase(State->Queues[endpoint]->begin());
            }
        }


    }

    if (Packet64) {

        USB_WriteEP(endpoint, Packet64->Buffer, Packet64->Size);

        g_LPC24_USB_Driver.TxNeedZLPS[endpoint] = false;
        if (Packet64->Size == 64 && _appendZP)
            g_LPC24_USB_Driver.TxNeedZLPS[endpoint] = true;

        if (done) {
            State->Queues[endpoint]->erase(State->Queues[endpoint]->begin());
        }

    }
    else {
        // send the zero length packet since we landed on the FIFO boundary before
        // (and we queued a zero length packet to transmit)
        if (g_LPC24_USB_Driver.TxNeedZLPS[endpoint]) {
            USB_WriteEP(endpoint, (uint8_t*)nullptr, 0);
            g_LPC24_USB_Driver.TxNeedZLPS[endpoint] = false;
        }

        // no more data
        g_LPC24_USB_Driver.TxRunning[endpoint] = false;
    }


}
void LPC24_USB_Driver::ControlNext() {

    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    if (State->DataCallback) {
        // this call can't fail
        State->DataCallback(State);

        if (State->DataSize == 0) {
            USB_WriteEP(CONTORL_EP_ADDR, (uint8_t*)nullptr, 0);
            State->DataCallback = nullptr;                         // Stop sending stuff if we're done
        }
        else {

            USB_WriteEP(CONTORL_EP_ADDR, State->Data, State->DataSize);

            if (State->DataSize < c_default_ctrl_packet_size)    // If packet is less than full length
            {
                State->DataCallback = nullptr;                     // Stop sending stuff if we're done
            }


            // special handling the USB driver set address test, cannot use the first descriptor as the ADDRESS state is handle in the hardware
            if (g_LPC24_USB_Driver.FirstDescriptorPacket) {
                State->DataCallback = nullptr;
            }

        }
    }
}

void LPC24_USB_Driver::Global_ISR(void* Param) {
    // we had a weird behavior without this here when disconnectin/connecting USB cable
    GLOBAL_LOCK(irq);

    int32_t disr, val, n, m;

    //for (volatile int ii = 0; ii < 0xFF; ii++);

    disr = USBDevIntSt;                      /* Device Interrupt Status */
    USBDevIntClr = disr;                       /* A known issue on LPC214x */

    if (disr & DEV_STAT_INT) {
        //DeviceInterruptCount++;

        WrCmd(CMD_GET_DEV_STAT);
        val = RdCmdDat(DAT_GET_DEV_STAT);       /* Device Status */

        if (val & DEV_RST)                     /* Reset */
        {
            ResetEvent();
        }

        if (val & DEV_SUS_CH)                  /* Suspend/Resume */
        {
            if (val & DEV_SUS)                   /* Suspend */
            {
                SuspendEvent();
            }
            else                               /* Resume */
            {
                ResumeEvent();
            }
        }

        goto isr_end;
    }

    /* Endpoint's Slow Interrupt */
    if (disr & EP_SLOW_INT) {

        //while (USBEpIntSt)                   /* Endpoint Interrupt Status */
        {
            for (n = 0; n < USB_EP_NUM; n++)     /* Check All Endpoints */
            {
                if ((USBEpIntSt & (1 << n)))//&& (USBEpIntEn & (1 << n)) )//only if enabled
                {
                    m = n >> 1;


                    if (m == 0)//EP0
                    {
                        USBEpIntClr = 1 << n;
                        while ((USBDevIntSt & CDFULL_INT) == 0);
                        val = USBCmdData;

                        if (val & EP_SEL_STP)        /* Setup Packet */
                        {
                            ProcessEP0(0, 1);// out setup
                            continue;
                        }
                        if ((n & 1) == 0)                /* OUT Endpoint */
                        {
                            ProcessEP0(0, 0);// out not setup
                        }
                        else {
                            ProcessEP0(1, 0);// in not setup
                        }

                        continue;
                    }
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        ProcessEndPoint(m, 0);//out
                        //USBC_EPEvent(m, true);
                    }
                    else                           /* IN Endpoint */
                    {
                        ProcessEndPoint(m, 1);//in
                        //USBC_EPEvent(m, false);
                    }
                }
            }
        }
    }

isr_end:
    return;
}


void LPC24_USB_Driver::EP0_ISR(uint32_t Param) {
    while (1);//this is not used?????????
}
void LPC24_USB_Driver::ProcessEP0(int in, int setup) {
    uint32_t EP_INTR;
    int i;

