ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
    GLOBAL_LOCK(irq);

    // set up packet receive
    if (setup)//(EP_INTR & LPC24_USB::UDCICR__PCKT) && (USB.UDCCSRx[0] & LPC24_USB::UDCCSR__OPC))
    {
        USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

        uint8_t   len = 0;//USB.UDCBCRx[0] & LPC24_USB::UDCBCR_mask;        // Received packet length

        len = USB_ReadEP(0x00, g_LPC24_USB_Driver.ControlPacketBuffer);

        // special handling for the very first SETUP command - Getdescriptor[DeviceType], the host looks for 8 bytes data only
        USB_SETUP_PACKET* Setup = (USB_SETUP_PACKET*)&g_LPC24_USB_Driver.ControlPacketBuffer[0];
        if ((Setup->bRequest == USB_GET_DESCRIPTOR) && (((Setup->wValue & 0xFF00) >> 8) == USB_DEVICE_DESCRIPTOR_TYPE) && (Setup->wLength != 0x12))
            g_LPC24_USB_Driver.FirstDescriptorPacket = true;
        else
            g_LPC24_USB_Driver.FirstDescriptorPacket = false;

        // send it to the upper layer
        State->Data = &g_LPC24_USB_Driver.ControlPacketBuffer[0];
        State->DataSize = len;

        uint8_t result = LPC24_UsbClient_ControlCallback(State);

        switch (result) {
            case USB_STATE_DATA:
                // setup packet was handled and the upper layer has data to send
                break;

            case USB_STATE_ADDRESS:
                // upper layer needs us to change the address
                // address stage handles in hardware
                USB_DeviceAddress = State->Address | 0x80;
                break;

            case USB_STATE_DONE:
                State->DataCallback = nullptr;
                break;

            case USB_STATE_STALL:
                // since the setup command all handled in the hardware, should not have this state
                //
                // setup packet failed to process successfully
                // set stall condition on the default control
                // endpoint
                //
                USB_SetStallEP(0, 0);
                USB_SetStallEP(0, 1);
                break;

            case USB_STATE_STATUS:
                // handle by hardware
                break;
            case USB_STATE_CONFIGURATION:
                // handle partly by hardware and the GLOBAL_ISR will take care.
                // USB spec 9.4.5 SET_CONFIGURATION resets halt conditions, resets toggle bits

                //int USB_Configure( int Controller, const USB_DYNAMIC_CONFIGURATION *config )////////////////////////////////////////////////////////////////////////////////////////////
                USB_HW_Configure(true);

                // enable all endpoints // ignore EP0
                for (i = 1; i < 16; i++) {
                    // direction in
                    USB_ConfigEP(i, 1, 64);
                    USB_EnableEP(i, 1);
                    USB_ResetEP(i, 1);

                    // direction out
                    USB_ConfigEP(i, 0, 64);
                    USB_EnableEP(i, 0);
                    USB_ResetEP(i, 0);
                }

                break;

            case USB_STATE_REMOTE_WAKEUP:
                // It is not using currently as the device side won't go into SUSPEND mode unless
                // the PC is purposely to select it to SUSPEND, as there is always SOF in the bus
                // to keeping the device from SUSPEND.
                break;

            default:

                break;
                // the status change is only seen and taken care in hardware
        }
        if (result != USB_STATE_STALL) {
            ControlNext();

            // If the port is configured, then output any possible withheld data
            if (result == USB_STATE_CONFIGURATION) {
                for (int ep = 0; ep < c_Used_Endpoints; ep++) {
                    if (State->IsTxQueue[ep])
                        StartOutput(State, ep);
                }
            }
        }
    }
    else if (in)//(EP_INTR & LPC24_USB::UDCICR__PCKT) && (USB.UDCCSRx[0] & (LPC24_USB::UDCCSR__IPR | LPC24_USB::UDCCSR__SST)) == 0)
    {
        // If previous packet has been sent and UDC is ready for more
        ControlNext();      // See if there is more to send
        if (USB_DeviceAddress & 0x80) {
            USB_DeviceAddress &= 0x7F;
            USB_SetAddress(USB_DeviceAddress);
        }
    }
    else {
        // This is for usb CDC
    }

}

void LPC24_USB_Driver::EP_TxISR(uint32_t endpoint) {
    ASSERT_IRQ_MUST_BE_OFF();

    uint32_t EP_INTR;
    int val;

    if (USBEpIntSt & (1 << EPAdr(endpoint, 1)))//done sending?
    {
        //clear interrupt flag
        USBEpIntClr = 1 << EPAdr(endpoint, 1);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;

        // successfully transmitted packet, time to send the next one
        TxPacket(g_LPC24_USB_Driver.pUsbControllerState, endpoint);
    }

}

static int testRX_cnt = 0;

void LPC24_USB_Driver::EP_RxISR(uint32_t endpoint) {
    bool          DisableRx;

    testRX_cnt++;

    if (testRX_cnt >= 5) {
        testRX_cnt = testRX_cnt + 0;
    }
    USB_PACKET64* Packet64 = LPC24_UsbClient_RxEnqueue(g_LPC24_USB_Driver.pUsbControllerState, endpoint, DisableRx);

    /* copy packet in, making sure that Packet64->Buffer is never overflowed */



    if (Packet64) {
        uint8_t   len = 0;//USB.UDCBCRx[EPno] & LPC24_USB::UDCBCR_mask;
        uint32_t* packetBuffer = (uint32_t*)Packet64->Buffer;
        len = USB_ReadEP(endpoint, Packet64->Buffer);

        // clear packet status
        nacking_rx_OUT_data[endpoint] = 0;
        Packet64->Size = len;
    }
    else {
        /* flow control should absolutely protect us from ever
        getting here, so if we do, it is a bug */
        nacking_rx_OUT_data[endpoint] = 1;//we will need to triger next interrupt

    }

}

void LPC24_USB_Driver::SuspendEvent() {
    //LPC24_USB& USB = LPC24::USB();
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side

    g_LPC24_USB_Driver.PreviousDeviceState = State->DeviceState;

