ghi-electronics/TinyCLR-Ports/Targets/LPC24/LPC24_USB.cpp
    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;

    LPC24_UsbClient_StateCallback(State);
}


void LPC24_USB_Driver::ResumeEvent() {
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    State->DeviceState = g_LPC24_USB_Driver.PreviousDeviceState;

    LPC24_UsbClient_StateCallback(State);

}



void LPC24_USB_Driver::ResetEvent() {
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    USB_Reset();
    USB_DeviceAddress = 0;

    // clear all flags
    UsbClient_Driver::ClearEvent(0, 0xFFFFFFFF);

    for (int ep = 0; ep < c_Used_Endpoints; ep++) {
        g_LPC24_USB_Driver.TxRunning[ep] = false;
        g_LPC24_USB_Driver.TxNeedZLPS[ep] = false;
    }

    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    State->Address = 0;
    LPC24_UsbClient_StateCallback(State);

}

//--//

bool LPC24_USB_Driver::RxEnable(USB_CONTROLLER_STATE *State, int endpoint) {
    if (nullptr == State || endpoint >= c_Used_Endpoints)
        return false;

    GLOBAL_LOCK(irq);

    if (nacking_rx_OUT_data[endpoint])
        EP_RxISR(endpoint);//force interrupt to read the pending EP

    return true;
}

bool LPC24_USB_Driver::ProtectPins(int Controller, bool On) {
    USB_CONTROLLER_STATE *State = g_LPC24_USB_Driver.pUsbControllerState;

    GLOBAL_LOCK(irq);

    // Initialized yet?
    if (State) {
        if (On) {
            if (!g_LPC24_USB_Driver.PinsProtected) {
                // Disable the USB com, state change from Not protected to Protected
                g_LPC24_USB_Driver.PinsProtected = true;

                USB_Reset();
                USB_DeviceAddress = 0;

                StopHardware();
            }
        }
        else {
            if (g_LPC24_USB_Driver.PinsProtected) {
                // Ready for USB to enable, state change from Protected to Not protected
                g_LPC24_USB_Driver.PinsProtected = false;

                // enable the clock,
                // set USB to attached/powered
                // set the device to a known state- Attached before it is set to the powered state (USB specf 9.1.1)
                //CPU_GPIO_EnableInputPin(LPC24_USB::c_USBC_GPION_DET, false, nullptr, GPIO_INT_NONE, RESISTOR_DISABLED);
                //CPU_GPIO_EnableOutputPin(LPC24_USB::c_USBC_GPIOX_EN, false);       // Don't signal the host yet
                State->DeviceState = USB_DEVICE_STATE_ATTACHED;

                LPC24_UsbClient_StateCallback(State);

                StartHardware();
            }
        }

        return true;
    }
    else {
        return false;
    }
}

